app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13')
---
  def index
    @movies = Movie.all
    @all_ratings = ["G","PG","PG-13","R"]



        #do this for sort also
	#if params[:ratings]
	#@ratings = params[:ratings]
	#elsif session[:ratings]
	#@ratings = session[:ratings]
	#else
	#@all_ratings.each do |r|
	#(@ratings ||= {})[r] = 1
	#end
	#end


	@movie = Movie.order(params[:sort])
	@movie = @movie.where(rating: params[:ratings].keys) if params[:ratings].present?